package com.example.takecare;




import android.app.Activity;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;
import android.widget.AdapterView.OnItemClickListener;


public class FoodActivity extends Activity {

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.activity_food);
		
		int[] resId = { R.drawable.food_1_nommae, 
						R.drawable.food_2_jokericebanana, 
						R.drawable.food_3_milkapple,
						R.drawable.food_4_vagetom,
						R.drawable.food_5_bread,
						R.drawable.food_6_jokefuktjong,
						R.drawable.food_7_fukfish,
						R.drawable.food_8_porkrice}; 

		String[] list = { "แรกเกิด - 4 เดือน" + 
		"มีความสามารถในการดูด กลืน และปิดปาก อาหารหลักคือน้ำนมแม่ หากให้อาหารเสริมช่วงนี้ ลูกจะใช้ลิ้นดันอาหารออกมา เพราะยังมี Tongue thrust reflex"
		,"4 – 6 เดือน "  +
		"ข้าวปั่นกล้วยครูด" + 
		"ส่วนผสม" +
        "กล้วยน้ำว้าสุก		8	ช้อนโต๊ะ" +
        "ข้าวกล้องสุก		8	ช้อนโต๊ะ" +
        "นมผสมชง		8	ออนซ์ หรือจะใช้น้ำนมแม่ก็ได้" +
        "น้ำต้มสุก		6	ออนซ์" +
        "วิธีทำ" +
        "1. ใส่ข้าวสุก กล้วยน้ำว้า นม และน้ำต้มสุก (ให้ค่อยๆ เติมน้ำทีละน้อยลงไปในขณะปั่น เพื่อไม่ให้ส่วนผสมเหลวเกินไป) ลงในเครื่องปั่น" +
        "2.จากนั้นกดปั่นในระดับที่เบาก่อน แล้วค่อยเร่งระดับ แล้วปั่นจนส่วนผสมทุกอย่างเข้ากันจนเป็นเนื้อเนียนละเอียด"
        ,"4 – 6 เดือน" +
        "แอปเปิ้ลต้มนม" +
        "ส่วนผสม" + 
        "แอปเปิ้ล 	2	ลูก" +
        "นมผสมชง 	9	ออนซ์" +
        "ข้าวกล้องสุก 	8	ช้อนโต๊ะ" +
        "วิธีทำ" +
        "1. ปอกเปลือกแอปเปิ้ล ล้างให้สะอาด แล้วหั่นเป็นชิ้นเล็กๆ" +
        "2. ตั้งหม้อในไฟอ่อนๆ แล้วใส่นม แอปเปิ้ล ข้าวสุก คนเรื่อยๆ ระวังอย่าให้นมเดือดจนไหม้ (ตั้งไฟประมาณ 7 นาที) ดูให้แอปเปิ้ลสุกเป็นใช้ได้" +
        "3.ยกส่วนผสมลงจากเตา ทิ้งไว้ให้เย็น จากนั้นก็นำไปปั่นในเครื่องปั่นให้เป็นเนื้อเนียนละเอียด"
        ,"7-9เดือน  ใช้นิ้วโป้งและนิ้วชี้หยิบอาหาร เริ่มกินอาหารจากช้อนได้ดีขึ้น ต้มผักให้นิ่ม และหั่นให้มีขนาดเท่าเมล็ดถั่ว เพื่อป้องกันอาหารติดคอ"
        ,"8-10 เดือน" + "เริ่มเคี้ยวอาหารโดยย้ายจากฟันกรามด้านหนึ่งไปอีกด้านหนึ่งได้ เริ่มดื่มน้ำจากแก้วได้ แม้อาจจะมีหกบ้างเล็กน้อย หากจะให้ลูกกินขนมปัง " +
        "หรือขนมปังกรอบควรทาเนยเล็กน้อย เพื่อป้องกันไม่ให้เศษขนมปังติดคอ"
        ,"9-12 เดือน (1ปี)" +
        "ถือถ้วยน้ำและช้อนได้เอง ชี้และเอื้อมคว้าอาหารเมื่อรู้สึกหิว แสดงความสนใจเมื่อเห็นคุณพ่อคุณแม่กินอาหาร ใส่เครื่องปรุงรสชาติในอาหารของลูกได้เล็กน้อย ควรระวังที่จะไม่ใส่เกลือมากเกินไป"
        +"โจ๊กฟักทองและกล้วยบด" +
        "ส่วนผสม" +
        "ข้าวสวยนิ่มๆ		ครึ่ง	ถ้วยตวง"+
        "เนื้อฟักทองสับละเอียด ครึ่ง	ถ้วยตวง (ใช้ฟักทองที่นึ่งแล้วก็ได้)" +
        "เนื้อกล้วย	1ส่วน4	ถ้วยตวง (ขูดเอาแต่เนื้อ)" +
        "น้ำสะอาด		1-2	ถ้วยตวง (ถ้าต้มนานใช้ 2 ถ้วยตวงขึ้นไป)"+
        "วิธีทำ" +
        "1. ปลอกเปลือกกล้วย แล้วใช้ช้อนค่อยๆ ขูดเอาแต่ส่วนเนื้อๆ เว้นส่วนที่เป็นเม็ดเล็กๆ ดำๆ ของแกนกลางทิ้งไป" +
        "2. ต้มน้ำในหม้อจนเดือด ใส่ฟักทอง ข้าว กล้วย ลงไปเคี่ยวจนเปื่อยใช้ทัพพี หรือแส้ทำขนมตีให้ส่วนผสม เละละเอียดเคี่ยวต่อจนข้นให้มีเหมือนโจ๊ก" 
        ,"18-24 เดือน (2 ปี)" +
        "ทักษะในการใช้ช้อนส้อมดีขึ้นมากผลักจานข้าวออกจากตัวเมื่อรู้สึกอิ่ม เริ่มเล่นหรือโยนอาหาร เริ่มใช้คำพูดสื่อสาร เช่น “เอาอีก” หรือ “อิ่มแล้ว” เพื่อแสดงให้คุณรู้ว่าเขาอิ่มหรือหิว"+
        "เมนู ฟักตุ๋นปลา" +
        "ส่วนผสม"+
        "1. ฟักอ่อนสับละเอียด  1ส่วน4 ถ้วย" +
        "2. น้ำซุป   ถ้วยครึ่ง" +
        "ปลาน้ำจืดเลือกก้างน้อยๆ" +
        "ซีอิ๊วขาว  ครึ่ง  ช้อนชา" +
        "วิธีทำ" +
        "1. ต้มเนื้อปลากับน้ำซุปจนสุก ปรุงรสด้วยซีอิ๊วขาว ยกลง" +
        "2. ตักใส่ถ้วย ใส่ฟักสับ ลงนึ่งในลังถึงประมาณ 10 นาที หรือฟักสุกนิ่มแล้ว กินคู่กับข้าวสวยร้อนๆ"
        ,"24-36 เดือน (3 ปี)" +
        "เริ่มกินอาหารได้เอง และเริ่มพัฒนาทักษะเกี่ยวกับการกินอื่นๆ เช่น มารยาทบนโต๊ะอาหาร พร้อมที่จะกินอาหารหลากหลาย หากคุณแม่เสนอทางเลือก เช่น ข้าวผัด หรือ ข่าวต้ม เจ้าตัวน้อยก็จะมีความสุขมากที่จะได้เลือกอาหารที่เขาต้องการ หลีกเลี่ยงอาหารเหนียวๆ เช่น กาละแม หรืออาหารชิ้นเล็กๆ แต่แข็ง เช่นถั่วลันเตาอบกรอบ หากเป็นไปได้ควรหั่นอาหารของลูกให้เป็นชิ้นเล็กๆ" +
        "เมนนูแนะนำ ขาวหน้าหมูซีอิ๋ว" +
        "ส่วนผสม" +
        "1. หมูสไลด์  1 ชิ้นใหญ่" +
        "2. ซีอิ๊ว แป้งข้าวโพด และน้ำมันหอย" +
        "3. ข้าวสวย		1 ทัพพี" +
        "4. แครอทหั่นยาวลวก  2 ช้อนโต๊ะ" +
        "5. บร็อคโคลีลวก 4-5 ดอก" +
        "วิธีทำ" +
        "1. สไลด์เนื้อหมูเป็นชิ้นบางๆ ขนาดค่อนข้างใหญ่ ทุบด้วยที่ทุบเนื้อเพื่อให้เครื่องหมัก (ซีอิ๊ว แป้งข้าวโพด และน้ำมันหอย) ซึมเข้าเนื้อได้ดีขึ้นและทำให้สุก" +
        "2. ตั้งกระทะเติมน้ำมันเล็กน้อย นำหมูลงไปผัดจนสุก ตักวางบนข้าวสวยร้อนๆ เสิร์ฟคู่กับผักที่เตรียมไว้"
        
	     };
	
	CustomAdapter adapter = new CustomAdapter(getApplicationContext(), list, resId);
	
	ListView listView = (ListView)findViewById(R.id.listView1);
    listView.setAdapter(adapter);
    listView.setOnItemClickListener(new OnItemClickListener() {
		public void onItemClick(AdapterView<?> arg0, View arg1, int arg2,
				long arg3) {

		}
    });
	}

	@Override
	public boolean onCreateOptionsMenu(Menu menu) {
		// Inflate the menu; this adds items to the action bar if it is present.
		getMenuInflater().inflate(R.menu.food, menu);
		return true;
	}

	@Override
	public boolean onOptionsItemSelected(MenuItem item) {
		// Handle action bar item clicks here. The action bar will
		// automatically handle clicks on the Home/Up button, so long
		// as you specify a parent activity in AndroidManifest.xml.
		int id = item.getItemId();
		if (id == R.id.action_settings) {
			return true;
		}
		return super.onOptionsItemSelected(item);
	}
	
	
}
